

import java.util.Scanner;

public class BonusScore {
    /*
        Дадено е цяло число – начален брой точки. Върху него се начисляват бонус точки по правилата, описани по-долу.
        Да се напише програма, която пресмята бонус точките, които получава числото и общия брой точки (числото + бонуса).
        •	Ако числото е до 100 включително, бонус точките са 5.
        •	Ако числото е по-голямо от 100, бонус точките са 20% от числото.
        •	Ако числото е по-голямо от 1000, бонус точките са 10% от числото.

        •	Допълнителни бонус точки (начисляват се отделно от предходните):
        o	За четно число  + 1 т.
        o	За число, което завършва на 5  + 2 т.
    */
    public static void main(String[] args) {
        Double bonusPoints = 0.0;
        Double bp = 0.0;

        Scanner scn = new Scanner(System.in);
        int n = Integer.parseInt(scn.nextLine());

        if (n % 2 == 0) { // За четно число  + 1 т.
            bp += 1;
        }

        if ((n % 5 == 0) && (!(n % 10 == 0))) { // За число, което завършва на 5  + 2 т.
            bp += 2;
        }

        if (n <= 100){ bp += 5; }
        else if (n >= 1000){ bp += n * 0.1; }
        else if (n > 100){ bp += n * 0.2; }

        Double n2 = Double.valueOf(n);
        n2 += bp;

        System.out.printf("%.1f", bp);
        System.out.printf("\n%.1f", n2);

    }
}
